#include"func.h"

void cout_test(void)
{
	int i = 2;

	cout << "cout_test, i=" << i << endl;
	cout << "i:" << i << "  i++:" << i++ << "  i:" << i << "  i--:" << i-- << "  i:" << i << "  --i:" << --i << "  i:" << i << "  ++i:" << ++i << "  i:" << i << "  --i:" << --i << "  i:" << i << "  i++:" << i++ << "  i:" << i << "  i--:" << i-- << endl;
	/*
	i:1
	i++ : 0  i : 1
	i-- : 1  i : 1
	--i : 1  i : 1
	++i : 1  i : 1
	--i : 1  i : 1
	i++ : 1  i : 1  当i--之后，i=1，之后进行输出i++。
	i-- : 2
	从下往上看，对应输出。
	*/
	//上述看起来不符合逻辑，这是因为和处理器以及编译器有关，环境的不同，所以不建议在实际中使用，可以移植性太烂。
	i = 5;
	cout << "i="<<i << " " << i++ << " " << i-- << endl;//i--：先把i=5压进栈，之后做--，此时i=4，
														//i++：当要输出i++时，吧i=4压进了栈，之后++，此时i=5
	i= 5;
	cout << i << " 22 " << ++i << " 11 " << --i << endl;
}